MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0VMI15/mcu.h
#define SPI0_MCR                      (*((volatile uint32_t *)0x4002C000))      // Module Configuration Register
#define SPI0_TCR                      (*((volatile uint32_t *)0x4002C008))      // Transfer Count Register
#define SPI0_CTAR0                    (*((volatile uint32_t *)0x4002C00C))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI0_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002C00C))      // Clock and Transfer Attributes Register (In Slave Mode)
#define SPI0_CTAR1                    (*((volatile uint32_t *)0x4002C010))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI0_SR                       (*((volatile uint32_t *)0x4002C02C))      // Status Register
#define SPI0_RSER                     (*((volatile uint32_t *)0x4002C030))      // DMA/Interrupt Request Select and Enable Register
#define SPI0_PUSHR                    (*((volatile uint32_t *)0x4002C034))      // PUSH TX FIFO Register In Master Mode
#define SPI0_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002C034))      // PUSH TX FIFO Register In Slave Mode
#define SPI0_POPR                     (*((volatile uint32_t *)0x4002C038))      // POP RX FIFO Register
#define SPI0_TXFR0                    (*((volatile uint32_t *)0x4002C03C))      // Transmit FIFO Registers
#define SPI0_TXFR1                    (*((volatile uint32_t *)0x4002C040))      // Transmit FIFO Registers
#define SPI0_TXFR2                    (*((volatile uint32_t *)0x4002C044))      // Transmit FIFO Registers
#define SPI0_TXFR3                    (*((volatile uint32_t *)0x4002C048))      // Transmit FIFO Registers
#define SPI0_RXFR0                    (*((volatile uint32_t *)0x4002C07C))      // Receive FIFO Registers
#define SPI0_RXFR1                    (*((volatile uint32_t *)0x4002C080))      // Receive FIFO Registers
#define SPI0_RXFR2                    (*((volatile uint32_t *)0x4002C084))      // Receive FIFO Registers
#define SPI0_RXFR3                    (*((volatile uint32_t *)0x4002C088))      // Receive FIFO Registers
#define SPI1_MCR                      (*((volatile uint32_t *)0x4002D000))      // Module Configuration Register
#define SPI1_TCR                      (*((volatile uint32_t *)0x4002D008))      // Transfer Count Register
#define SPI1_CTAR0                    (*((volatile uint32_t *)0x4002D00C))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI1_CTAR0_SLAVE              (*((volatile uint32_t *)0x4002D00C))      // Clock and Transfer Attributes Register (In Slave Mode)
#define SPI1_CTAR1                    (*((volatile uint32_t *)0x4002D010))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI1_SR                       (*((volatile uint32_t *)0x4002D02C))      // Status Register
#define SPI1_RSER                     (*((volatile uint32_t *)0x4002D030))      // DMA/Interrupt Request Select and Enable Register
#define SPI1_PUSHR                    (*((volatile uint32_t *)0x4002D034))      // PUSH TX FIFO Register In Master Mode
#define SPI1_PUSHR_SLAVE              (*((volatile uint32_t *)0x4002D034))      // PUSH TX FIFO Register In Slave Mode
#define SPI1_POPR                     (*((volatile uint32_t *)0x4002D038))      // POP RX FIFO Register
#define SPI1_TXFR0                    (*((volatile uint32_t *)0x4002D03C))      // Transmit FIFO Registers
#define SPI1_TXFR1                    (*((volatile uint32_t *)0x4002D040))      // Transmit FIFO Registers
#define SPI1_TXFR2                    (*((volatile uint32_t *)0x4002D044))      // Transmit FIFO Registers
#define SPI1_TXFR3                    (*((volatile uint32_t *)0x4002D048))      // Transmit FIFO Registers
#define SPI1_RXFR0                    (*((volatile uint32_t *)0x4002D07C))      // Receive FIFO Registers
#define SPI1_RXFR1                    (*((volatile uint32_t *)0x4002D080))      // Receive FIFO Registers
#define SPI1_RXFR2                    (*((volatile uint32_t *)0x4002D084))      // Receive FIFO Registers
#define SPI1_RXFR3                    (*((volatile uint32_t *)0x4002D088))      // Receive FIFO Registers
#define SPI2_MCR                      (*((volatile uint32_t *)0x400AC000))      // Module Configuration Register
#define SPI2_TCR                      (*((volatile uint32_t *)0x400AC008))      // Transfer Count Register
#define SPI2_CTAR0                    (*((volatile uint32_t *)0x400AC00C))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI2_CTAR0_SLAVE              (*((volatile uint32_t *)0x400AC00C))      // Clock and Transfer Attributes Register (In Slave Mode)
#define SPI2_CTAR1                    (*((volatile uint32_t *)0x400AC010))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI2_SR                       (*((volatile uint32_t *)0x400AC02C))      // Status Register
#define SPI2_RSER                     (*((volatile uint32_t *)0x400AC030))      // DMA/Interrupt Request Select and Enable Register
#define SPI2_PUSHR                    (*((volatile uint32_t *)0x400AC034))      // PUSH TX FIFO Register In Master Mode
#define SPI2_PUSHR_SLAVE              (*((volatile uint32_t *)0x400AC034))      // PUSH TX FIFO Register In Slave Mode
#define SPI2_POPR                     (*((volatile uint32_t *)0x400AC038))      // POP RX FIFO Register
#define SPI2_TXFR0                    (*((volatile uint32_t *)0x400AC03C))      // Transmit FIFO Registers
#define SPI2_TXFR1                    (*((volatile uint32_t *)0x400AC040))      // Transmit FIFO Registers
#define SPI2_TXFR2                    (*((volatile uint32_t *)0x400AC044))      // Transmit FIFO Registers
#define SPI2_TXFR3                    (*((volatile uint32_t *)0x400AC048))      // Transmit FIFO Registers
#define SPI2_RXFR0                    (*((volatile uint32_t *)0x400AC07C))      // Receive FIFO Registers
#define SPI2_RXFR1                    (*((volatile uint32_t *)0x400AC080))      // Receive FIFO Registers
#define SPI2_RXFR2                    (*((volatile uint32_t *)0x400AC084))      // Receive FIFO Registers
#define SPI2_RXFR3                    (*((volatile uint32_t *)0x400AC088))      // Receive FIFO Registers
#define SPI3_MCR                      (*((volatile uint32_t *)0x400AD000))      // Module Configuration Register
#define SPI3_TCR                      (*((volatile uint32_t *)0x400AD008))      // Transfer Count Register
#define SPI3_CTAR0                    (*((volatile uint32_t *)0x400AD00C))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI3_CTAR0_SLAVE              (*((volatile uint32_t *)0x400AD00C))      // Clock and Transfer Attributes Register (In Slave Mode)
#define SPI3_CTAR1                    (*((volatile uint32_t *)0x400AD010))      // Clock and Transfer Attributes Register (In Master Mode)
#define SPI3_SR                       (*((volatile uint32_t *)0x400AD02C))      // Status Register
#define SPI3_RSER                     (*((volatile uint32_t *)0x400AD030))      // DMA/Interrupt Request Select and Enable Register
#define SPI3_PUSHR                    (*((volatile uint32_t *)0x400AD034))      // PUSH TX FIFO Register In Master Mode
#define SPI3_PUSHR_SLAVE              (*((volatile uint32_t *)0x400AD034))      // PUSH TX FIFO Register In Slave Mode
#define SPI3_POPR                     (*((volatile uint32_t *)0x400AD038))      // POP RX FIFO Register
#define SPI3_TXFR0                    (*((volatile uint32_t *)0x400AD03C))      // Transmit FIFO Registers
#define SPI3_TXFR1                    (*((volatile uint32_t *)0x400AD040))      // Transmit FIFO Registers
#define SPI3_TXFR2                    (*((volatile uint32_t *)0x400AD044))      // Transmit FIFO Registers
#define SPI3_TXFR3                    (*((volatile uint32_t *)0x400AD048))      // Transmit FIFO Registers
#define SPI3_RXFR0                    (*((volatile uint32_t *)0x400AD07C))      // Receive FIFO Registers
#define SPI3_RXFR1                    (*((volatile uint32_t *)0x400AD080))      // Receive FIFO Registers
#define SPI3_RXFR2                    (*((volatile uint32_t *)0x400AD084))      // Receive FIFO Registers
#define SPI3_RXFR3                    (*((volatile uint32_t *)0x400AD088))      // Receive FIFO Registers


//*****************************************************************************
//
// Inter-Integrated Circuit (I2C) registers
//
//*****************************************************************************

#define I2C0_A1                       (*((volatile uint32_t *)0x40066000))      // I2C Address Register 1 (I2C0_A1)
#define I2C0_F                        (*((volatile uint32_t *)0x40066001))      // I2C Frequency Divider register (I2C0_F)
#define I2C0_C1                       (*((volatile uint32_t *)0x40066002))      // I2C Control Register 1 (I2C0_C1)
#define I2C0_S                        (*((volatile uint32_t *)0x40066003))      // I2C Status register (I2C0_S)
#define I2C0_D                        (*((volatile uint32_t *)0x40066004))      // I2C Data I/O register (I2C0_D)
#define I2C0_C2                       (*((volatile uint32_t *)0x40066005))      // I2C Control Register 2 (I2C0_C2)
#define I2C0_FLT                      (*((volatile uint32_t *)0x40066006))      // I2C Programmable Input Glitch Filter Register (I2C0_FLT)
#define I2C0_RA                       (*((volatile uint32_t *)0x40066007))      // I2C Range Address register (I2C0_RA)
#define I2C0_SMB                      (*((volatile uint32_t *)0x40066008))      // I2C SMBus Control and Status register (I2C0_SMB)
#define I2C0_A2                       (*((volatile uint32_t *)0x40066009))      // I2C Address Register 2 (I2C0_A2)
#define I2C0_SLTH                     (*((volatile uint32_t *)0x4006600A))      // I2C SCL Low Timeout Register High (I2C0_SLTH)
#define I2C0_SLTL                     (*((volatile uint32_t *)0x4006600B))      // I2C SCL Low Timeout Register Low (I2C0_SLTL)
#define I2C0_S2                       (*((volatile uint32_t *)0x4006600C))      // I2C Status register 2 (I2C0_S2)
#define I2C1_A1                       (*((volatile uint32_t *)0x40067000))      // I2C Address Register 1 (I2C1_A1)
#define I2C1_F                        (*((volatile uint32_t *)0x40067001))      // I2C Frequency Divider register (I2C1_F)
#define I2C1_C1                       (*((volatile uint32_t *)0x40067002))      // I2C Control Register 1 (I2C1_C1)
#define I2C1_S                        (*((volatile uint32_t *)0x40067003))      // I2C Status register (I2C1_S)
#define I2C1_D                        (*((volatile uint32_t *)0x40067004))      // I2C Data I/O register (I2C1_D)
#define I2C1_C2                       (*((volatile uint32_t *)0x40067005))      // I2C Control Register 2 (I2C1_C2)
#define I2C1_FLT                      (*((volatile uint32_t *)0x40067006))      // I2C Programmable Input Glitch Filter Register (I2C1_FLT)
#define I2C1_RA                       (*((volatile uint32_t *)0x40067007))      // I2C Range Address register (I2C1_RA)
#define I2C1_SMB                      (*((volatile uint32_t *)0x40067008))      // I2C SMBus Control and Status register (I2C1_SMB)
#define I2C1_A2                       (*((volatile uint32_t *)0x40067009))      // I2C Address Register 2 (I2C1_A2)
#define I2C1_SLTH                     (*((volatile uint32_t *)0x4006700A))      // I2C SCL Low Timeout Register High (I2C1_SLTH)
#define I2C1_SLTL                     (*((volatile uint32_t *)0x4006700B))      // I2C SCL Low Timeout Register Low (I2C1_SLTL)
#define I2C1_S2                       (*((volatile uint32_t *)0x4006700C))      // I2C Status register 2 (I2C1_S2)
#define I2C2_A1                       (*((volatile uint32_t *)0x400E6000))      // I2C Address Register 1 (I2C2_A1)
#define I2C2_F                        (*((volatile uint32_t *)0x400E6001))      // I2C Frequency Divider register (I2C2_F)
#define I2C2_C1                       (*((volatile uint32_t *)0x400E6002))      // I2C Control Register 1 (I2C2_C1)
#define I2C2_S                        (*((volatile uint32_t *)0x400E6003))      // I2C Status register (I2C2_S)
#define I2C2_D                        (*((volatile uint32_t *)0x400E6004))      // I2C Data I/O register (I2C2_D)
#define I2C2_C2                       (*((volatile uint32_t *)0x400E6005))      // I2C Control Register 2 (I2C2_C2)
#define I2C2_FLT                      (*((volatile uint32_t *)0x400E6006))      // I2C Programmable Input Glitch Filter Register (I2C2_FLT)
#define I2C2_RA                       (*((volatile uint32_t *)0x400E6007))      // I2C Range Address register (I2C2_RA)
#define I2C2_SMB                      (*((volatile uint32_t *)0x400E6008))      // I2C SMBus Control and Status register (I2C2_SMB)
#define I2C2_A2                       (*((volatile uint32_t *)0x400E6009))      // I2C Address Register 2 (I2C2_A2)
#define I2C2_SLTH                     (*((volatile uint32_t *)0x400E600A))      // I2C SCL Low Timeout Register High (I2C2_SLTH)
#define I2C2_SLTL                     (*((volatile uint32_t *)0x400E600B))      // I2C SCL Low Timeout Register Low (I2C2_SLTL)
#define I2C2_S2                       (*((volatile uint32_t *)0x400E600C))      // I2C Status register 2 (I2C2_S2)
#define I2C3_A1                       (*((volatile uint32_t *)0x400E7000))      // I2C Address Register 1 (I2C3_A1)
#define I2C3_F                        (*((volatile uint32_t *)0x400E7001))      // I2C Frequency Divider register (I2C3_F)
#define I2C3_C1                       (*((volatile uint32_t *)0x400E7002))      // I2C Control Register 1 (I2C3_C1)
#define I2C3_S                        (*((volatile uint32_t *)0x400E7003))      // I2C Status register (I2C3_S)
#define I2C3_D                        (*((volatile uint32_t *)0x400E7004))      // I2C Data I/O register (I2C3_D)
#define I2C3_C2                       (*((volatile uint32_t *)0x400E7005))      // I2C Control Register 2 (I2C3_C2)
#define I2C3_FLT                      (*((volatile uint32_t *)0x400E7006))      // I2C Programmable Input Glitch Filter Register (I2C3_FLT)
#define I2C3_RA                       (*((volatile uint32_t *)0x400E7007))      // I2C Range Address register (I2C3_RA)
#define I2C3_SMB                      (*((volatile uint32_t *)0x400E7008))      // I2C SMBus Control and Status register (I2C3_SMB)
#define I2C3_A2                       (*((volatile uint32_t *)0x400E7009))      // I2C Address Register 2 (I2C3_A2)
#define I2C3_SLTH                     (*((volatile uint32_t *)0x400E700A))      // I2C SCL Low Timeout Register High (I2C3_SLTH)
#define I2C3_SLTL                     (*((volatile uint32_t *)0x400E700B))      // I2C SCL Low Timeout Register Low (I2C3_SLTL)
#define I2C3_S2                       (*((volatile uint32_t *)0x400E700C))      // I2C Status register 2 (I2C3_S2)


//*****************************************************************************
//
// Low Power Universal asynchronous receiver/transmitter (LPUART) registers
//
//*****************************************************************************

#define LPUART0_BAUD                  (*((volatile uint32_t *)0x400C4000))      // LPUART Baud Rate Register
#define LPUART0_STAT                  (*((volatile uint32_t *)0x400C4004))      // LPUART Status Register
#define LPUART0_CTRL                  (*((volatile uint32_t *)0x400C4008))      // LPUART Control Register
#define LPUART0_DATA                  (*((volatile uint32_t *)0x400C400C))      // LPUART Data Register
#define LPUART0_MATCH                 (*((volatile uint32_t *)0x400C4010))      // LPUART Match Address Register
#define LPUART0_MODIR                 (*((volatile uint32_t *)0x400C4014))      // LPUART Modem IrDA Register
#define LPUART0_FIFO                  (*((volatile uint32_t *)0x400C4018))      // LPUART FIFO Register
#define LPUART0_WATER                 (*((volatile uint32_t *)0x400C401C))      // LPUART Watermark Register
#define LPUART1_BAUD                  (*((volatile uint32_t *)0x400C5000))      // LPUART Baud Rate Register
#define LPUART1_STAT                  (*((volatile uint32_t *)0x400C5004))      // LPUART Status Register
#define LPUART1_CTRL                  (*((volatile uint32_t *)0x400C5008))      // LPUART Control Register
#define LPUART1_DATA                  (*((volatile uint32_t *)0x400C500C))      // LPUART Data Register
#define LPUART1_MATCH                 (*((volatile uint32_t *)0x400C5010))      // LPUART Match Address Register
#define LPUART1_MODIR                 (*((volatile uint32_t *)0x400C5014))      // LPUART Modem IrDA Register
#define LPUART1_FIFO                  (*((volatile uint32_t *)0x400C5018))      // LPUART FIFO Register
#define LPUART1_WATER                 (*((volatile uint32_t *)0x400C501C))      // LPUART Watermark Register
#define LPUART2_BAUD                  (*((volatile uint32_t *)0x400C6000))      // LPUART Baud Rate Register
#define LPUART2_STAT                  (*((volatile uint32_t *)0x400C6004))      // LPUART Status Register
#define LPUART2_CTRL                  (*((volatile uint32_t *)0x400C6008))      // LPUART Control Register
#define LPUART2_DATA                  (*((volatile uint32_t *)0x400C600C))      // LPUART Data Register
#define LPUART2_MATCH                 (*((volatile uint32_t *)0x400C6010))      // LPUART Match Address Register
#define LPUART2_MODIR                 (*((volatile uint32_t *)0x400C6014))      // LPUART Modem IrDA Register
#define LPUART2_FIFO                  (*((volatile uint32_t *)0x400C6018))      // LPUART FIFO Register
#define LPUART2_WATER                 (*((volatile uint32_t *)0x400C601C))      // LPUART Watermark Register
#define LPUART3_BAUD                  (*((volatile uint32_t *)0x400C7000))      // LPUART Baud Rate Register
#define LPUART3_STAT                  (*((volatile uint32_t *)0x400C7004))      // LPUART Status Register
#define LPUART3_CTRL                  (*((volatile uint32_t *)0x400C7008))      // LPUART Control Register
#define LPUART3_DATA                  (*((volatile uint32_t *)0x400C700C))      // LPUART Data Register
#define LPUART3_MATCH                 (*((volatile uint32_t *)0x400C7010))      // LPUART Match Address Register
#define LPUART3_MODIR                 (*((volatile uint32_t *)0x400C7014))      // LPUART Modem IrDA Register
#define LPUART3_FIFO                  (*((volatile uint32_t *)0x400C7018))      // LPUART FIFO Register
#define LPUART3_WATER                 (*((volatile uint32_t *)0x400C701C))      // LPUART Watermark Register
#define LPUART4_BAUD                  (*((volatile uint32_t *)0x400D6000))      // LPUART Baud Rate Register
#define LPUART4_STAT                  (*((volatile uint32_t *)0x400D6004))      // LPUART Status Register
#define LPUART4_CTRL                  (*((volatile uint32_t *)0x400D6008))      // LPUART Control Register
#define LPUART4_DATA                  (*((volatile uint32_t *)0x400D600C))      // LPUART Data Register
#define LPUART4_MATCH                 (*((volatile uint32_t *)0x400D6010))      // LPUART Match Address Register
#define LPUART4_MODIR                 (*((volatile uint32_t *)0x400D6014))      // LPUART Modem IrDA Register
#define LPUART4_FIFO                  (*((volatile uint32_t *)0x400D6018))      // LPUART FIFO Register
#define LPUART4_WATER                 (*((volatile uint32_t *)0x400D601C))      // LPUART Watermark Register


//*****************************************************************************
//
// Integrated Interchip Sound (I2S) / Synchronous Audio Interface (SAI) registers
//
//*****************************************************************************

