MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0VMI15/mcu.h
#define HRSn                          0x7FFFFFFF80000000      // Hardware Request Status Channel n
#define HRS31                         0x80000000      // Hardware Request Status Channel 31
#define HRS30                         0x40000000      // Hardware Request Status Channel 30
#define HRS29                         0x20000000      // Hardware Request Status Channel 29
#define HRS28                         0x10000000      // Hardware Request Status Channel 28
#define HRS27                         0x08000000      // Hardware Request Status Channel 27
#define HRS26                         0x04000000      // Hardware Request Status Channel 26
#define HRS25                         0x02000000      // Hardware Request Status Channel 25
#define HRS24                         0x01000000      // Hardware Request Status Channel 24
#define HRS23                         0x00800000      // Hardware Request Status Channel 23
#define HRS22                         0x00400000      // Hardware Request Status Channel 22
#define HRS21                         0x00200000      // Hardware Request Status Channel 21
#define HRS20                         0x00100000      // Hardware Request Status Channel 20
#define HRS19                         0x00080000      // Hardware Request Status Channel 19
#define HRS18                         0x00040000      // Hardware Request Status Channel 18
#define HRS17                         0x00020000      // Hardware Request Status Channel 17
#define HRS16                         0x00010000      // Hardware Request Status Channel 16
#define HRS15                         0x00008000      // Hardware Request Status Channel 15
#define HRS14                         0x00004000      // Hardware Request Status Channel 14
#define HRS13                         0x00002000      // Hardware Request Status Channel 13
#define HRS12                         0x00001000      // Hardware Request Status Channel 12
#define HRS11                         0x00000800      // Hardware Request Status Channel 11
#define HRS10                         0x00000400      // Hardware Request Status Channel 10
#define HRS9                          0x00000200      // Hardware Request Status Channel 9
#define HRS8                          0x00000100      // Hardware Request Status Channel 8
#define HRS7                          0x00000080      // Hardware Request Status Channel 7
#define HRS6                          0x00000040      // Hardware Request Status Channel 6
#define HRS5                          0x00000020      // Hardware Request Status Channel 5
#define HRS4                          0x00000010      // Hardware Request Status Channel 4
#define HRS3                          0x00000008      // Hardware Request Status Channel 3
#define HRS2                          0x00000004      // Hardware Request Status Channel 2
#define HRS1                          0x00000002      // Hardware Request Status Channel 1
#define HRS0                          0x00000001      // Hardware Request Status Channel 0


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_EARS register.
//
//*****************************************************************************

#define EDREQn                        0x7FFFFFFF80000000      // Enable asynchronous DMA request in stop mode for channel n
#define EDREQ_31                      0x80000000      // Enable asynchronous DMA request in stop mode for channel 31
#define EDREQ_30                      0x40000000      // Enable asynchronous DMA request in stop mode for channel 30
#define EDREQ_29                      0x20000000      // Enable asynchronous DMA request in stop mode for channel 29
#define EDREQ_28                      0x10000000      // Enable asynchronous DMA request in stop mode for channel 28
#define EDREQ_27                      0x08000000      // Enable asynchronous DMA request in stop mode for channel 27
#define EDREQ_26                      0x04000000      // Enable asynchronous DMA request in stop mode for channel 26
#define EDREQ_25                      0x02000000      // Enable asynchronous DMA request in stop mode for channel 25
#define EDREQ_24                      0x01000000      // Enable asynchronous DMA request in stop mode for channel 24
#define EDREQ_23                      0x00800000      // Enable asynchronous DMA request in stop mode for channel 23
#define EDREQ_22                      0x00400000      // Enable asynchronous DMA request in stop mode for channel 22
#define EDREQ_21                      0x00200000      // Enable asynchronous DMA request in stop mode for channel 21
#define EDREQ_20                      0x00100000      // Enable asynchronous DMA request in stop mode for channel 20
#define EDREQ_19                      0x00080000      // Enable asynchronous DMA request in stop mode for channel 19
#define EDREQ_18                      0x00040000      // Enable asynchronous DMA request in stop mode for channel 18
#define EDREQ_17                      0x00020000      // Enable asynchronous DMA request in stop mode for channel 17
#define EDREQ_16                      0x00010000      // Enable asynchronous DMA request in stop mode for channel 16
#define EDREQ_15                      0x00008000      // Enable asynchronous DMA request in stop mode for channel 15
#define EDREQ_14                      0x00004000      // Enable asynchronous DMA request in stop mode for channel 14
#define EDREQ_13                      0x00002000      // Enable asynchronous DMA request in stop mode for channel 13
#define EDREQ_12                      0x00001000      // Enable asynchronous DMA request in stop mode for channel 12
#define EDREQ_11                      0x00000800      // Enable asynchronous DMA request in stop mode for channel 11
#define EDREQ_10                      0x00000400      // Enable asynchronous DMA request in stop mode for channel 10
#define EDREQ_9                       0x00000200      // Enable asynchronous DMA request in stop mode for channel 9
#define EDREQ_8                       0x00000100      // Enable asynchronous DMA request in stop mode for channel 8
#define EDREQ_7                       0x00000080      // Enable asynchronous DMA request in stop mode for channel 7
#define EDREQ_6                       0x00000040      // Enable asynchronous DMA request in stop mode for channel 6
#define EDREQ_5                       0x00000020      // Enable asynchronous DMA request in stop mode for channel 5
#define EDREQ_4                       0x00000010      // Enable asynchronous DMA request in stop mode for channel 4
#define EDREQ_3                       0x00000008      // Enable asynchronous DMA request in stop mode for channel 3
#define EDREQ_2                       0x00000004      // Enable asynchronous DMA request in stop mode for channel 2
#define EDREQ_1                       0x00000002      // Enable asynchronous DMA request in stop mode for channel 1
#define EDREQ_0                       0x00000001      // Enable asynchronous DMA request in stop mode for channel 0


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_DCHPRIn register.
//
//*****************************************************************************

