MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0VMI15/mcu.h
#define ATME                          0x00000080      // Automatic Trim Machine Enable
#define ATMS                          0x00000040      // Automatic Trim Machine Select
#define ATMF                          0x00000020      // Automatic Trim Machine Fail Flag
#define FLTPRSRV                      0x00000010      // FLL Filter Preserve Enable
#define FCRDIV                        0x00000038      // Fast Clock Internal Reference Divider
#define LOCS0                         0x00000001      // OSC0 Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_ATCVH register.
//
//*****************************************************************************




//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_ATCVL register.
//
//*****************************************************************************




//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C7 register.
//
//*****************************************************************************

#define OSCSEL                        0x00000001      // MCG OSC Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C8 register.
//
//*****************************************************************************

#define LOCRE1                        0x00000080      // Loss of Clock Reset Enable
#define LOLRE                         0x00000040      // PLL Loss of Lock Reset Enable
#define CME1                          0x00000020      // Clock Monitor Enable1
#define LOCS1                         0x00000001      // RTC Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C9 register.
//
//*****************************************************************************

#define PLL_CME                       0x00000020      // MCG External PLL Clock Monitor Enable
#define PLL_LOCRE                     0x00000010      // MCG External PLL Loss of Clock Reset Enable
#define EXT_PLL_LOCS                  0x00000001      // External PLL Loss of Clock Status


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_C11 register.
//
//*****************************************************************************

#define PLLCS                         0x00000010      // PLL Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the MCG_S2 register.
//
//*****************************************************************************

#define PLLCST                        0x00000010      // PLL Clock Select Status


//*****************************************************************************
//
// The following are defines for the bit fields in the OSC_CR register.
//
//*****************************************************************************

#define ERCLKEN                       0x00000080      // Enable External Reference Clock
#define EREFSTEN                      0x00000020      // Enable External Reference Clock for Startup
#define SC2P                          0x00000008      // Select Clock 2 Prescaler
#define SC4P                          0x00000004      // Select Clock 4 Prescaler
#define SC8P                          0x00000002      // Select Clock 8 Prescaler
#define SC16P                         0x00000001      // Select Clock 16 Prescaler


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCCR register.
//
//*****************************************************************************

#define GO                            0x80000000      // Initiate Cache Command
#define PUSHW1                        0x08000000      // Push Way 1
#define INVW1                         0x04000000      // Invalidate Way 1
#define PUSHW0                        0x02000000      // Push Way 0
#define INVW0                         0x01000000      // Invalidate Way 0
#define PCCR3                         0x00000008      // Forces no allocation on cache misses (must also have PCCR2 asserted)
#define PCCR2                         0x00000004      // Forces all cacheable spaces to write through
#define ENWRBUF                       0x00000002      // Enable Write Buffer
#define ENCACHE                       0x00000001      // Cache enable


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCLCR register.
//
//*****************************************************************************

#define LACC                          0x08000000      // Line access type
#define LADSEL                        0x04000000      // Line Address Select
#define LCMD                          0x06000000      // Line Command
#define LCWAY                         0x00400000      // Line Command Way
#define LCIMB                         0x00200000      // Line Command Initial Modified Bit
#define LCIVB                         0x00100000      // Line Command Initial Valid Bit
#define TDSEL                         0x00010000      // Tag/Data Select
#define WSEL                          0x00004000      // Way select
#define LGO                           0x00000001      // Initiate Cache Line Command


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCSAR register.
//
//*****************************************************************************

#define PHYADDR                       0x1FFFFFFF80000000      // Physical Address
#define LGO                           0x00000001      // Initiate Cache Line Command


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCCVR register.
//
//*****************************************************************************

#define DATA                          0x7FFFFFFF80000000      // Cache read/write Data


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PCCRMR register.
//
//*****************************************************************************

#define R0                            0x180000000      // Region 0 mode
#define R1                            0x60000000      // Region 1 mode
#define R2                            0x18000000      // Region 2 mode
#define R3                            0x06000000      // Region 3 mode
#define R4                            0x01800000      // Region 4 mode
#define R5                            0x00600000      // Region 5 mode
#define R6                            0x00180000      // Region 6 mode
#define R7                            0x00060000      // Region 7 mode
#define R8                            0x00018000      // Region 8 mode
#define R9                            0x00006000      // Region 9 mode
#define R10                           0x00001800      // Region 10 mode
#define R11                           0x00000600      // Region 11 mode
#define R12                           0x00000180      // Region 12 mode
#define R13                           0x00000060      // Region 13 mode
#define R14                           0x00000018      // Region 14 mode
#define R15                           0x00000006      // Region 15 mode


//*****************************************************************************
//
// The following are defines for the bit fields in the LMEM_PSCCR register.
//
//*****************************************************************************

