MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0VMI15/mcu.h
#define JSTATE                        0x00000080      // Live USB differential receiver JSTATE signal
#define SE0                           0x00000040      // Live USB Single Ended Zero signal
#define TXSUSPENDTOKENBUSY            0x00000020      // In Host mode, TOKEN_BUSY is set when the USB module is busy executing a USB token
#define RESET                         0x00000010      // Setting this bit enables the USB Module to generate USB reset signaling
#define HOSTMODEEN                    0x00000008      // When set to 1, this bit enables the USB Module to operate in Host mode
#define RESUME                        0x00000004      // When set to 1 this bit enables the USB Module to execute resume signaling
#define ODDRST                        0x00000002      // Setting this bit to 1 resets all the BDT ODD ping/pong fields to 0, which then specifies the EVEN BDT bank
#define USBENSOFEN                    0x00000001      // USB Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ADDR register.
//
//*****************************************************************************

#define LSEN                          0x00000080      // Low Speed Enable bit
#define ADDR                          0x00001FC0      // USB Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_ENDPTn register.
//
//*****************************************************************************

#define HOSTWOHUB                     0x00000080      // Host without a hub
#define RETRYDIS                      0x00000040      // When set to 1, this bit causes the host to not retry NAK'ed (Negative Acknowledgement) transactions
#define EPCTLDIS                      0x00000010      // This bit, when set, disables control (SETUP) transfers
#define EPRXEN                        0x00000008      // This bit, when set, enables the endpoint for RX transfers
#define EPTXEN                        0x00000004      // This bit, when set, enables the endpoint for TX transfers
#define EPSTALL                       0x00000002      // When set, this bit indicates that the endpoint is stalled
#define EPHSHK                        0x00000001      // When set this bit enables an endpoint to perform handshaking during a transaction to this endpoint


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE1 register.
//
//*****************************************************************************

#define BDTBA                         0x00003F80      // Provides address bits 15 through 9 of the BDT base address.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUML register.
//
//*****************************************************************************

#define FRM[7:0]                      0x00007F80      // This 8-bit field and the 3-bit field in the Frame Number Register High are used  to  compute  the  address where the current Buffer Descriptor Table (BDT) resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_FRMNUMH register.
//
//*****************************************************************************

#define FRM[10:8]                     0x0000001C      // This 3-bit field and the 8-bit field in the Frame Number Register Low are used  to  compute the  address where the current Buffer Descriptor Table (BDT) resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_TOKEN register.
//
//*****************************************************************************

#define TOKENPID                      0x00000780      // Contains the token type executed by the USB module.
#define TOKENENDPT                    0x00000078      // Holds the Endpoint address for the token command. The four bit value written must be a valid endpoint.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_SOFTHLD register.
//
//*****************************************************************************

#define CNT                           0x07FFE000      // Represents the SOF count threshold in byte times when SOFDYNTHLD=0 or 8 byte times when SOFDYNTHLD=1.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE2 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // Provides address bits 23 through 16 of the BDT base address that defines     the  location  of  Buffer  Descriptor Table resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_BDTPAGE3 register.
//
//*****************************************************************************

#define BDTBA                         0x00007F80      // Provides address bits 31 through 24 of the BDT base address that defines     the  location  of  Buffer  Descriptor Table resides in system memory.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBCTRL register.
//
//*****************************************************************************

#define SUSP                          0x00000080      // Places the USB transceiver into the suspend state.
#define PDE                           0x00000040      // Enables the weak pulldowns on the USB transceiver.
#define UARTCHLS                      0x00000020      // UART Signal Channel Select. This field is valid only when USB signals are selected to be used  as  UART   signals.
#define UARTSEL                       0x00000010      // Selects USB signals to be used as UART signals.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_OBSERVE register.
//
//*****************************************************************************

#define DPPU                          0x00000080      // Provides observability of the D+ Pullup enable at the USB transceiver.
#define DPPD                          0x00000040      // Provides observability of the D+ Pulldown enable at the USB transceiver.
#define DMPD                          0x00000010      // Provides observability of the D- Pulldown enable at the USB transceiver.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CONTROL register.
//
//*****************************************************************************

#define DPPULLUPNONOTG                0x00000010      // Provides control of the DP Pullup in USBOTG, if USB is configured  in   non-OTG device mode.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBTRC0 register.
//
//*****************************************************************************

#define USBRESET                      0x00000080      // Generates a hard reset to USBOTG. After this bit is set and the reset occurs, this bit is automatically cleared.
#define USBRESMEN                     0x00000020      // Asynchronous Resume Interrupt Enable. This bit, when set, allows the USB module to send an asynchronous wakeup event to the MCU upon detection of resume signaling on the USB bus. The MCU then re-enables clocks to the USB module. It is used for low-power suspend mode when USB module clocks are stopped or the USB transceiver is in Suspend mode. Async wakeup only works in device mode.
#define VFEDG_DET                     0x00000010      // VREGIN Falling Edge Interrupt Detect. Use USBx_MISCCTRL[VFEDG_EN] to enable this bitfield.
#define VREDG_DET                     0x00000008      // VREGIN Rising Edge Interrupt Detect. Use USBx_MISCCTRL[VREDG_EN] to enable this bitfield.
#define USB_CLK_RECOVERY_INT          0x00000004      // Combined USB Clock Recovery interrupt status. This read-only field will be set to value high at 1'b1 when any of USB clock recovery interrupt conditions are detected and those interrupts are unmasked.
#define SYNC_DET                      0x00000002      // Synchronous USB Interrupt Detect.
#define USB_RESUME_INT                0x00000001      // USB Asynchronous Interrupt.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_USBFRMADJUST register.
//
//*****************************************************************************

#define ADJ                           0x00007F80      // Frame Adjustment. In Host mode, the frame adjustment is a twos complement number that adjusts the period of each USB frame in 12-MHz clock periods. A SOF is normally generated every 12,000 12-MHz clock cycles. The Frame Adjust Register can adjust this by -128 to +127 to compensate for inaccuracies in the USB 48-MHz clock. Changes to the ADJ bit take effect at the start of the next frame.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_MISCCTRL register.
//
//*****************************************************************************

#define VFEDG_EN                      0x00000010      // VREGIN Falling Edge Interrupt Enable.
#define VREDG_EN                      0x00000008      // VREGIN Rising Edge Interrupt Enable.
#define OWNERRISODIS                  0x00000004      // OWN Error Detect for ISO IN / ISO OUT Disable. This field is only valid for Peripheral mode, that is, CTL[HOSTMODEEN]=0.
#define SOFBUSSET                     0x00000002      // SOF_TOK Interrupt Generation Mode Select. This field is only valid for Host mode, that is, CTL[HOSTMODEEN]=1.
#define SOFDYNTHLD                    0x00000001      // Dynamic SOF Threshold Compare mode. This field is only valid for Host mode, that is, CTL[HOSTMODEEN]=1.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_CTRL register.
//
//*****************************************************************************

#define CLOCK_RECOVER_EN              0x00000080      // Crystal-less USB enable. This bit must be enabled if user wants to use the crystal-less USB mode for the  Full Speed   USB controller and transceiver.
#define RESET_ROUGH_EN                0x00000040      // Reset/resume to rough phase enable. The clock recovery block tracks the IRC48M to get an accurate 48Mhz clock. It has two phases after user enables clock_recover_en bit, rough phase and tracking phase. The step to fine tune the IRC48M by adjusting the trim fine value is different during these 2 phases. The step in rough phase is larger than that in tracking phase. Switch back to rough stage whenever USB bus reset or bus resume occurs.
#define RESTART_IFRTRIM_EN            0x00000020      // Restart from IFR trim value. IRC48M has a default trim fine value whose default value is factory trimmed (the IFR trim value). Clock recover block tracks the accuracy of the clock 48Mhz and keeps updating the trim fine value accordingly.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_IRC_EN register.
//
//*****************************************************************************

#define IRC_EN                        0x00000002      // IRC48M enable. This bit is used to enable the on-chip IRC48M module to generate clocks for crystal-less USB. It can be used for FS USB device mode operation. This bit must be set before using the crystal-less USB clock configuration.
#define REG_EN                        0x00000001      // IRC48M regulator enable. This bit is used to enable the local analog regulator for IRC48M module. This bit must be set if user wants to use the crystal-less USB clock configuration.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_INT_EN register.
//
//*****************************************************************************

#define OVF_ERROR_EN                  0x00000010      // Determines whether OVF_ERROR condition                  signal is used in  generation  of  USB_CLK_RECOVERY_INT.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_INT_STATUS register.
//
//*****************************************************************************

#define OVF_ERROR                     0x00000010      // Indicates that the USB clock recovery algorithm has detected that the frequency trim adjustment needed for the IRC48M output clock is outside the available TRIM_FINE adjustment range for the IRC48M module.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBDCD_CONTROL register.
//
//*****************************************************************************

