MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0VMI15/mcu.h
#define VBUS_VALID_3V                 0x00000010      // VBUS_VALID_3V detector status
#define VBUS_VALID                    0x00000008      // VBUS voltage status
#define AVALID                        0x00000004      // A-Device Session Valid status
#define BVALID                        0x00000002      // B-Device Session Valid status
#define SESSEND                       0x00000001      // Session End indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_CHRG_DET_STAT register.
//
//*****************************************************************************

#define SECDET_DCP                    0x00000010      // Battery Charging Secondary Detection phase output
#define DP_STATE                      0x00000008      // Single ended receiver output for the USB_DP pin, from charger detection circuits
#define DM_STATE                      0x00000004      // Single ended receiver output for the USB_DM pin, from charger detection circuits
#define CHRG_DETECTED                 0x00000002      // Battery Charging Primary Detection phase output
#define PLUG_CONTACT                  0x00000001      // Battery Charging Data Contact Detection phase output


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_ANACTRLn register.
//
//*****************************************************************************

#define EMPH_CUR_CTRL                 0x00018000      // Controls the amount of pre-emphasis current added for the High-Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1'b1
#define EMPH_EN                       0x00002000      // Enables pre-emphasis for the High-Speed TX drivers
#define EMPH_PULSE_CTRL               0x00003000      // Controls pre-emphasis time duration for the High Speed TX drivers after each data transition when the USBPHY_ANACTRL[EMPH_EN] bit is set high to 1'b1
#define DEV_PULLDOWN                  0x00000400      // Setting this field to 1'b1 will enable the 15kΩ pulldown resistors on both USB_DP and USB_DM pins
#define PFD_FRAC                      0x00007E00      // PFD fractional divider setting used to select the pfd_clk output frequency
#define PFD_CLK_SEL                   0x00000018      // This bit field for the PFD selects the frequency relationship between the local pfd_clk output and the exported USB1PFDCLK
#define PFD_CLKGATE                   0x00000002      // This bit field controls clock gating (disabling) for the PFD pfd_clk output for power savings when the PFD is not used
#define TESTCLK_SEL                   0x00000001      // Test clock selection to analog test


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_LOOPBACKn register.
//
//*****************************************************************************

#define TSTPKT                        0x7F800000      // Selects the packet data byte used for USB loopback testing in Pulse mode
#define TSTI_HSFS_MODE_EN             0x00008000      // Setting this bit field to value 1'b1 will enable the loopback test to dynamically change the packet speed
#define UTMO_DIG_TST1                 0x00000100      // Mode control for USB loopback test
#define UTMO_DIG_TST0                 0x00000080      // Mode control for USB loopback test
#define TSTI_TX_HIZ                   0x00000040      // Sets TX Hi-Z for USB loopback test
#define TSTI_TX_EN                    0x00000020      // Enable TX for USB loopback test
#define TSTI_TX_LS_MODE               0x00000010      // Set to value 1'b1 to choose LS for USB loopback testing, set to value 1'b0 to choose HS or FS mode
#define TSTI_TX_HS_MODE               0x00000008      // Select HS or FS mode for USB loopback testing
#define UTMI_DIG_TST1                 0x0000000C      // Mode control for USB loopback test
#define UTMI_TESTSTART                0x00000001      // This bit enables the USB loopback test


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_USB1_LOOPBACK_HSFSCNTn register.
//
//*****************************************************************************

#define TSTI_FS_NUMBER                0x7FFF80000000      // Full speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN] is set to value 1'b1
#define TSTI_HS_NUMBER                0x7FFF8000      // High speed packet number, used when USBPHY_USB1_LOOPBACK[TSTI_HSFS_MODE_EN] is set to value 1'b1 ::


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_TRIM_OVERRIDE_ENn register.
//
//*****************************************************************************

#define TRIM_TX_CAL45DM_OVERRIDE      0x00000010      // Enables the override of the nominal 45Ω series termination resistance to the USB_DM output pin
#define TRIM_TX_CAL45DP_OVERRIDE      0x00000008      // Enables the override of the nominal 45Ω series termination resistance to the USB_DP output pin
#define TRIM_TX_D_CAL_OVERRIDE        0x00000004      // Enables the override of the nominal 17.78mA current source for the High Speed TX drivers on USB_DP and USB_DM
#define TRIM_ENV_TAIL_ADJ_VD_OVERRIDE 0x00000002      // Enables the override of the delay increment of the rise of squelch
#define TRIM_PLL_DIV_SEL_OVERRIDE     0x00000001      // Enables the override of the PLL reference frequency


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_MCR register.
//
//*****************************************************************************

#define MSTR                          0x80000000      // Master/Slave Mode Select
#define CONT_SCKE                     0x40000000      // Continuous SCK Enable
#define DCONF                         0x60000000      // SPI Configuration
#define FRZ                           0x08000000      // Freeze
#define MTFE                          0x04000000      // Modified Transfer Format Enable
#define PCSSE                         0x02000000      // Peripheral Chip Select Strobe Enable
#define ROOE                          0x01000000      // Receive FIFO Overflow Overwrite Enable
#define PCSIS                         0x07E00000      // Peripheral Chip Select x Inactive State
#define DOZE                          0x00008000      // Doze Enable
#define MDIS                          0x00004000      // Module Disable
#define DIS_TXF                       0x00002000      // Disable Transmit FIFO
#define DIS_RXF                       0x00001000      // Disable Receive FIFO
#define CLR_TXF                       0x00000800      // Clear TX FIFO
#define CLR_RXF                       0x00000400      // Clear RX FIFO
#define SMPL_PT                       0x00000600      // Sample Point
#define HALT                          0x00000001      // Halt


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_TCR register.
//
//*****************************************************************************

#define SPI_TCNT                      0x7FFF80000000      // SPI Transfer Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_CTARn register.
//
//*****************************************************************************

#define DBR                           0x80000000      // Double Baud Rate
#define FMSZ                          0x3C0000000      // Frame Size
#define CPOL                          0x04000000      // Clock Polarity
#define CPHA                          0x02000000      // Clock Phase
#define LSBFE                         0x01000000      // LSB First
#define PCSSCK                        0x01800000      // PCS to SCK Delay Prescaler
#define PASC                          0x00600000      // After SCK Delay Prescaler
#define PDT                           0x00180000      // Delay after Transfer Prescaler
#define PBR                           0x00060000      // Baud Rate Prescaler
#define CSSCK                         0x00078000      // PCS to SCK Delay Scaler
#define ASC                           0x00007800      // After SCK Delay Scaler
#define DT                            0x00000780      // Delay After Transfer Scaler
#define BR                            0x00000078      // Baud Rate Scaler


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_CTARn_SLAVE register.
//
//*****************************************************************************

#define FMSZ                          0x3C0000000      // Frame Size
#define CPOL                          0x04000000      // Clock Polarity
#define CPHA                          0x02000000      // Clock Phase


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_SR register.
//
//*****************************************************************************

#define TCF                           0x80000000      // Transfer Complete Flag
#define TXRXS                         0x40000000      // TX and RX Status
#define EOQF                          0x10000000      // End of Queue Flag
#define TFUF                          0x08000000      // Transmit FIFO Underflow Flag
#define TFFF                          0x02000000      // Transmit FIFO Fill Flag
#define RFOF                          0x00080000      // Receive FIFO Overflow Flag
#define RFDF                          0x00020000      // Receive FIFO Drain Flag
#define TXCTR                         0x00078000      // TX FIFO Counter
#define TXNXTPTR                      0x00007800      // Transmit Next Pointer
#define RXCTR                         0x00000780      // RX FIFO Counter


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_RSER register.
//
//*****************************************************************************

#define TCF_RE                        0x80000000      // Transmission Complete Request Enable
#define EOQF_RE                       0x10000000      // Finished Request Enable
#define TFUF_RE                       0x08000000      // Transmit FIFO Underflow Request Enable
#define TFFF_RE                       0x02000000      // Transmit FIFO Fill Request Enable
#define TFFF_DIRS                     0x01000000      // Transmit FIFO Fill DMA or Interrupt Request Select
#define RFOF_RE                       0x00080000      // Receive FIFO Overflow Request Enable
#define RFDF_RE                       0x00020000      // Receive FIFO Drain Request Enable
#define RFDF_DIRS                     0x00010000      // Receive FIFO Drain DMA or Interrupt Request Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_PUSHR register.
//
//*****************************************************************************

#define CONT                          0x80000000      // Continuous Peripheral Chip Select Enable
#define CTAS                          0x1C0000000      // Clock and Transfer Attributes Select
#define EOQ                           0x08000000      // End  Of Queue
#define CTCNT                         0x04000000      // Clear Transfer Counter
#define PCS                           0x07E00000      // Select which PCS signals are to be asserted      for  the  transfer
#define TXDATA                        0x7FFF8000      // Transmit Data


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_PUSHR_SLAVE register.
//
//*****************************************************************************

#define TXDATA                        0x7FFF8000      // Transmit Data


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_POPR register.
//
//*****************************************************************************

#define RXDATA                        0x7FFFFFFF80000000      // Received Data


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_TXFRn register.
//
//*****************************************************************************

#define TXCMD_TXDATA                  0x7FFF80000000      // Transmit Command or Transmit Data
#define TXDATA                        0x7FFF8000      // Transmit Data


//*****************************************************************************
//
// The following are defines for the bit fields in the SPIx_RXFRn register.
//
//*****************************************************************************

#define RXDATA                        0x7FFFFFFF80000000      // Receive Data ::


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Cx_A1 register.
//
//*****************************************************************************

