MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0VMI15/mcu.h
#define                               0x7F80000000      // This field is reserved
#define TXEMPT                        0x00800000      // Transmit Buffer/FIFO Empty
#define RXEMPT                        0x00400000      // Receive Buffer/FIFO Empty
#define                               0x01E00000      // This field is reserved
#define TXOF                          0x00020000      // Transmitter Buffer Overflow Flag
#define RXUF                          0x00010000      // Receiver Buffer Underflow Flag
#define TXFLUSH                       0x00008000      // Transmit FIFO/Buffer Flush
#define RXFLUSH                       0x00004000      // Receive FIFO/Buffer Flush
#define                               0x00002000      // This field is reserved
#define RXIDEN                        0x00007000      // Receiver Idle Empty Enable
#define TXOFE                         0x00000200      // Transmit FIFO Overflow Interrupt Enable
#define RXUFE                         0x00000100      // Receive FIFO Underflow Interrupt Enable
#define TXFE                          0x00000080      // Transmit FIFO Enable
#define TXFIFOSIZE                    0x000001C0      // Transmit FIFO. Buffer Depth
#define RXFE                          0x00000008      // Receive FIFO Enable
#define RXFIFOSIZE                    0x0000001C      // Receive FIFO. Buffer Depth


//*****************************************************************************
//
// The following are defines for the bit fields in the LPUARTx_WATER register.
//
//*****************************************************************************

#define RXCOUNT                       0x7F80000000      // Receive Counter
#define RXWATER                       0x7F800000      // Receive Watermark
#define TXCOUNT                       0x007F8000      // Transmit Counter
#define TXWATER                       0x00007F80      // Transmit Watermark ::


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCSR register.
//
//*****************************************************************************

#define TE                            0x80000000      // Transmitter Enable
#define STOPE                         0x40000000      // Stop Enable
#define DBGE                          0x20000000      // Debug Enable
#define BCE                           0x10000000      // Bit Clock Enable
#define FR                            0x02000000      // FIFO Reset
#define SR                            0x01000000      // Software Reset
#define WSF                           0x00100000      // Word Start Flag
#define SEF                           0x00080000      // Sync Error Flag
#define FEF                           0x00040000      // FIFO Error Flag
#define FWF                           0x00020000      // FIFO Warning Flag
#define FRF                           0x00010000      // FIFO Request Flag
#define WSIE                          0x00001000      // Word Start Interrupt Enable
#define SEIE                          0x00000800      // Sync Error Interrupt Enable
#define FEIE                          0x00000400      // FIFO Error Interrupt Enable
#define FWIE                          0x00000200      // FIFO Warning Interrupt Enable
#define FRIE                          0x00000100      // FIFO Request Interrupt Enable
#define FWDE                          0x00000002      // FIFO Warning DMA Enable
#define FRDE                          0x00000001      // FIFO Request DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR1 register.
//
//*****************************************************************************

#define TFW                           0x0000001C      // Transmit FIFO Watermark


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR2 register.
//
//*****************************************************************************

#define SYNC                          0x180000000      // Synchronous Mode
#define BCS                           0x20000000      // Bit Clock Swap
#define BCI                           0x10000000      // Bit Clock Input
#define MSEL                          0x18000000      // MCLK Select
#define BCP                           0x02000000      // Bit Clock Polarity
#define BCD                           0x01000000      // Bit Clock Direction
#define DIV                           0x00007F80      // Bit Clock Divide


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR3 register.
//
//*****************************************************************************

#define CFR                           0x06000000      // Channel FIFO Reset
#define TCE                           0x00060000      // Transmit Channel Enable
#define WDFL                          0x00000001      // Word Flag Configuration


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR4 register.
//
//*****************************************************************************

#define FCONT                         0x10000000      // FIFO Continue on Error
#define FCOMB                         0x18000000      // FIFO Combine Mode
#define FPACK                         0x06000000      // FIFO Packing Mode
#define FRSZ                          0x01F00000      // Frame size
#define SYWD                          0x0001F000      // Sync Width
#define Reserved                      0x00000380      // 
#define MF                            0x00000010      // MSB First
#define FSE                           0x00000008      // Frame Sync Early
#define ONDEM                         0x00000004      // On Demand Mode
#define FSP                           0x00000002      // Frame Sync Polarity
#define FSD                           0x00000001      // Frame Sync Direction


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TCR5 register.
//
//*****************************************************************************

#define WNW                           0x1F0000000      // Word N Width
#define W0W                           0x01F00000      // Word 0 Width
#define FBT                           0x0001F000      // First Bit Shifted


//*****************************************************************************
//
// The following are defines for the bit fields in the I2Sx_TDRn register.
//
//*****************************************************************************

